tutorials/untested/reactingCylPimple2D/constant/reactiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Dictionary for right hand side of thermDCRRhoPorousSimpleFOAM

/* 
    Prepared kinetics setup:
        1) CO oxidation -- inhibition kinetics accroding to 3D reconstruction and pore-scale modeling of coated catalytic filters for automotive exhaust gas aftertreatment (Koci 17)
        2) general power law kinetics -- r = \Pi_{\all i} k*c_i^alpha_i
        ==> switch using kinSetupSwitch 1 or 2
*/

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

reactProps
{
    // -- list of switches for reactions on/off
    activeReacts    (1);                                          
    
    // -- CO oxidation
    reaction00{
        kinSetupSwitch 1;                       // -- special kinetics for CO oxidation
        k0  k0  [0 -3 -1 0 1 0 0]   7.84e16;
        sHr sHr [1 2 -2 0 -1 0 0]   -283e3;	
        EA	EA	[1  2 -2 0 -1 0 0]  90000.0;
        kin	kin	[0 0 0 0 0 0 0]		80;
        Ein	Ein	[0 0 0 1 0 0 0]		1000;
    }
    
    // -- numerical properties for gradients
    numProps
    {
        clipGradMin     -1e10;
        clipGradMax     1e10;
    }
}

// ************************************************************************* //
